Docs/Reference/Content/images/dependencies/net10.0/d2/alloverit-pagination.d2
direction: left

aoi: AllOverIt
aoi.alloverit-pagination: AllOverIt.Pagination
microsoft-extensions-dependencyinjection-abstractions_10-0-9: Microsoft.Extensions.DependencyInjection.Abstractions\nv10.0.9
aoi.alloverit-serialization-binary: AllOverIt.Serialization.Binary
aoi.alloverit: AllOverIt
aoi.alloverit-assertion: AllOverIt.Assertion
microsoft-extensions-dependencyinjection-abstractions_10-0-9 <- aoi.alloverit-pagination
aoi.alloverit-serialization-binary <- aoi.alloverit-pagination
aoi.alloverit <- aoi.alloverit-serialization-binary
aoi.alloverit-assertion <- aoi.alloverit
microsoft-extensions-dependencyinjection-abstractions_10-0-9.style.fill: "#ADD8E6"
microsoft-extensions-dependencyinjection-abstractions_10-0-9.style.opacity: 0.8
aoi.style.fill: "#E7EBFC"
aoi.style.opacity: 1
